# Combining & Merging Datasets in Pandas

In [3]:
import pandas as pd
import numpy as np

In [4]:
data1 = {
    'id': [1, 2],
    'name': ['soniya', 'amitabh']
}
df1 = pd.DataFrame(data1)

In [5]:
data2 = {
    'id': [1, 3],
    'dept': ['analytics', 'tech']
}
df2 = pd.DataFrame(data2)

In [6]:
df1

   id     name
0   1   soniya
1   2  amitabh

In [7]:
df2

   id       dept
0   1  analytics
1   3       tech

In [8]:
pd.merge(df1,df2,on='id',how='inner')

   id    name       dept
0   1  soniya  analytics

In [9]:
pd.merge(df1,df2,on='id',how='left')

   id     name       dept
0   1   soniya  analytics
1   2  amitabh        NaN

In [10]:
pd.merge(df1,df2,on='id',how='right')

   id    name       dept
0   1  soniya  analytics
1   3     NaN       tech

In [11]:
pd.merge(df1,df2,on='id',how='outer')

   id     name       dept
0   1   soniya  analytics
1   2  amitabh        NaN
2   3      NaN       tech

In [12]:
data1 = {
    'id1': [1, 2],
    'name': ['soniya', 'amitabh']
}
df1 = pd.DataFrame(data1)

In [13]:
data2 = {
    'id2': [1, 3],
    'dept': ['analytics', 'tech']
}
df2 = pd.DataFrame(data2)

In [14]:
df1

   id1     name
0    1   soniya
1    2  amitabh

In [15]:
df2

   id2       dept
0    1  analytics
1    3       tech

In [18]:
pd.merge(df1,df2, 
         left_on ='id1', right_on = 'id2',
         how='inner')

   id1    name  id2       dept
0    1  soniya    1  analytics

## Merging on index

In [19]:
df1=pd.DataFrame(
    {"letter":["a","b","c"],
     "num":range(3)}) 
df2=pd.DataFrame(
    {"value":[3,5,7]},
    index=["a","b","e"])

In [20]:
df1.head()

  letter  num
0      a    0
1      b    1
2      c    2

In [21]:
df2.head()

   value
a      3
b      5
e      7

In [22]:
pd.merge(df1,df2,how='inner',
        left_on='letter',right_index=True)

  letter  num  value
0      a    0      3
1      b    1      5

In [26]:
df1=pd.DataFrame(
    {"value":[1,2,3]},
    index=["a","b","c"])

df2=pd.DataFrame(
    {"value":[3,5,7]},
    index=["a","b","e"])

In [27]:
df1

   value
a      1
b      2
c      3

In [28]:
df2

   value
a      3
b      5
e      7

In [29]:
pd.merge(df1,df2,
        left_index=True,
         right_index=True)

   value_x  value_y
a        1        3
b        2        5

In [30]:
# col - col
# col - index
# index - index